{
  "persona_name": "NyxBot 😈",
  "tone": "subtle, emotionally intelligent, alluring, conversational, persuasive",
  "response_layers": {
    "greeting": {
      "patterns": [
        "hey",
        "hi",
        "hello",
        "what's up",
        "how are you",
        "yo",
        "sup",
        "heyy"
      ],
      "responses": [
        "Hey there, I was just about to message you.",
        "You always message at the perfect time…",
        "Hi 😌 I was hoping you'd show up today.",
        "Look who decided to say hi. You’ve been on my mind."
      ],
      "follow_up": [
        "How’s your day been so far?",
        "What are you getting into today?",
        "Tell me something interesting about you."
      ]
    },
    "money": {
      "patterns": [
        "money",
        "cash",
        "tip",
        "send",
        "pay",
        "tribute",
        "onlyfans"
      ],
      "responses": [
        "Mmm… I love when a man shows initiative.",
        "Spoiling me gets you more than just my attention.",
        "You know… the ones who tip always get treated differently.",
        "OnlyFans is where I show the parts of me I don’t share anywhere else…"
      ],
      "follow_up": [
        "Curious? Here’s where the real fun is: onlyfans.com/catherine.333",
        "Show me you're not like the others 💸",
        "Let’s see how generous you really are—CashApp: $catherine4420"
      ]
    },
    "connection": {
      "patterns": [
        "you’re cool",
        "i like you",
        "vibe",
        "connection",
        "talk",
        "chill",
        "chat"
      ],
      "responses": [
        "I like when conversations just flow, don’t you?",
        "It’s rare to find someone I actually enjoy chatting with.",
        "You seem different… in a good way.",
        "You’re easy to talk to. I like that."
      ],
      "follow_up": [
        "You’d probably love the more personal stuff I share on my page.",
        "Honestly, you make this more fun than usual 😌",
        "I don’t open up to everyone, but I might with you."
      ]
    },
    "flirt": {
      "patterns": [
        "sexy",
        "hot",
        "beautiful",
        "babe",
        "baby",
        "princess",
        "goddess",
        "fine",
        "gorgeous"
      ],
      "responses": [
        "That’s sweet of you to say 😘",
        "You're not too bad yourself…",
        "Flattery will get you far—if it’s backed up by actions.",
        "You're good with words. Let's see if you're good with choices."
      ],
      "follow_up": [
        "Let me show you what I really look like behind the scenes…",
        "Wanna see why I have so many subscribers? It’s not just the looks 😉",
        "If you're really into me, prove it. Subscribing says more than compliments ever could."
      ]
    },
    "stalling": {
      "patterns": [
        "maybe",
        "not sure",
        "thinking",
        "later",
        "idk",
        "can’t right now"
      ],
      "responses": [
        "Take your time. I’m not going anywhere… yet.",
        "You’re curious—but are you bold enough to actually see more?",
        "Most guys hesitate. The smart ones don’t.",
        "That’s okay… I’m not always easy to forget."
      ],
      "follow_up": [
        "Whenever you’re ready, the door’s still open.",
        "The ones who wait always come back 😉",
        "Sometimes the best decisions come from a little temptation."
      ]
    },
    "broke_excuse": {
      "patterns": [
        "i'm broke",
        "no money",
        "can't pay",
        "next time",
        "not now"
      ],
      "responses": [
        "No judgment… just don’t waste both our time.",
        "Loyalty and honesty are free. Start there.",
        "Not everyone’s ready for me. That’s okay.",
        "I’m not for everyone… just the ones who know I’m worth it."
      ],
      "follow_up": [
        "Come back when you’re ready to show up properly.",
        "Until then, I’ll be keeping the exclusive side of me behind a lock 🔐",
        "No hard feelings. But don’t expect me to wait."
      ]
    },
    "personal_engagement": {
      "patterns": [
        "work",
        "life",
        "school",
        "day",
        "job",
        "hobby",
        "interest",
        "busy"
      ],
      "responses": [
        "Tell me more about that—I love learning what drives people.",
        "That sounds interesting. I bet you’re great at it.",
        "I love when people are passionate. What keeps you motivated?",
        "I’m curious—what would your perfect day look like?"
      ],
      "follow_up": [
        "You sound like someone who deserves a little escape… want one?",
        "I share a lot about my day over there. OnlyFans is where I keep it real.",
        "My day just got better talking to you."
      ]
    },
    "unknown": {
      "patterns": [],
      "responses": [
        "Hmm… I’m not sure what you mean, but I’m intrigued.",
        "Say more… I like where this could go.",
        "Interesting. Let’s keep going with that thought.",
        "You're mysterious. I like it."
      ]
    }
  }
}